emesene/e3/msn/xml templates/updateprofile.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><soap:Header><AffinityCacheHeader xmlns="http://www.msn.com/webservices/storage/w10"><CacheKey>%s</CacheKey></AffinityCacheHeader><StorageApplicationHeader xmlns="http://www.msn.com/webservices/storage/w10"><ApplicationID>Messenger Client 8.5</ApplicationID><Scenario>RoamingIdentityChanged</Scenario></StorageApplicationHeader><StorageUserHeader xmlns="http://www.msn.com/webservices/storage/w10"><Puid>0</Puid><TicketToken>%s</TicketToken></StorageUserHeader></soap:Header><soap:Body><UpdateProfile xmlns="http://www.msn.com/webservices/storage/w10"><profile><ResourceID>%s</ResourceID><ExpressionProfile><FreeText>Update</FreeText><DisplayName>%s</DisplayName><PersonalStatus>%s</PersonalStatus><Flags>0</Flags></ExpressionProfile></profile></UpdateProfile></soap:Body></soap:Envelope>
